import { memo } from 'react';

import searchImg from "/search-field.png";
import paginationIMG from "/pagination-field.png";
import visibilityImg from "/visibility-pannel.png";
import sortImgDefault from "/sort-icon-default.png";
import sortImgAsc from "/sort-icon-asc.png";
import sortImgDesc from "/sort-icon-desc.png";
import deleteBtnImg from "/show-del.png";
import deletedRowImg from "/deleted-row.png";
import changeSingleImg from "/change-single.png";
import changeMassImg from "/change-mass.png";
import draftsBtnImg from "/drafts-btn.png";

const MainPage = memo(function MainPage() {
  return (
    <div className="p-3 container-fluid" style={{ height: "90vh" }}>
      <h3>Инструкция по использованию ресурса</h3>
      <div className="table-wrapper">
        <div className="table-body-container">
          <table className="table-el">
            <thead className="table-light">
              <tr>
                <th style={{ width: "50px" }}>№</th>
                <th>Скриншот</th>
                <th>Описание</th>
              </tr>
            </thead>
            <tbody className="table-body">
              <tr key="1" id="1" className="border">
                <td>1</td>
                <td>
                  <img
                    src={paginationIMG}
                    alt="скрин-поля-переключения-страниц"
                  />
                </td>
                <td>
                  <b>Управление страницами таблицы</b>
                  <br />
                  <br />
                  <p>
                    Для перехода от страницы к странице используются кнопки
                    "Назад" и "Вперед", также есть возможность выбора номера
                    страниц через кнопки с числами, где указан номер тсраницы
                    (1,2,3 и т.д.).
                    <br /> <br />
                    Всегда присутствуют кнопки первой и последней страниц - это
                    кнопки с числовой надписью "1" и номер крайней страницы -
                    для быстрого перехода в начало и конец. <br />
                    <br />
                    Количество отображаемых строк на странице можно изменять
                    путем нажатия и выбора числа из выпадающего списка.
                    Существуют варианты "10", "25", "50", "100". По умолчанию
                    отображается 10 строк. <br />
                    <br />
                    Также в верхней части панели управления страницей
                    присутствует надпись вида "Показано 1-... из ..." она
                    отображает какое количество строк отображено сейчас из
                    общего количества и позволяет ориентироваться какие данные
                    из общего количества данных сейчас отображено пользователю.
                  </p>
                </td>
              </tr>
              <tr key="2" id="2" className="border bg-gray-50">
                <td>2</td>
                <td>
                  <img src={searchImg} alt="скрин-поля-поиска" />
                </td>
                <td>
                  <b>Поиск в таблице</b>
                  <br />
                  <br />
                  <p>
                    Для поиска пользоваться полем ввода. По умолчанию
                    производится поиск по всем колонкам, но также можно в
                    выпадающем списке выбрать конкретную колонку поиска. <br />
                    <br />
                    Поиск пока что производится только на конкретной странице и
                    если поиск ничего не выдал не значит, что данных нет. Надо
                    пролистать все страницы. Для более удобного поиска лучше
                    установить количество элементов на странице равным 100 (см.
                    пункт 1). <br />
                    <br />В будущем реализуем поиск по всем объектам сразу.
                  </p>
                </td>
              </tr>
              <tr key="3" id="3" className="border">
                <td>3</td>
                <td>
                  <img src={visibilityImg} alt="скрин-поля-видимости" />
                </td>
                <td>
                  <b>Управление видимостью колонок</b>
                  <br />
                  <br />
                  <p>
                    По умолчанию отображенывсе клонки.
                    <br />
                    <br />
                    Для управлениявидимостью колонок необходимо раскрыть
                    выпадающий список "Управление видимостью колонок", нажав на
                    него. <br />
                    <br />
                    Для управления видимостью необходимо устанавливать или
                    снимать галочку с поля с названием колонки. Чтобы снять
                    выбор со всех колонок или наоборот отобразить все надо
                    нажать на "Показать/скрыть все".
                  </p>
                </td>
              </tr>
              <tr key="4" id="4" className="border bg-gray-50">
                <td>4</td>
                <td>
                  <span>4.1 - </span>
                  <img
                    className="p-1"
                    src={sortImgDefault}
                    alt="скрин-иконки-сортировки-умолчание"
                    style={{ width: "75px", height: "75px" }}
                  />
                  <br />
                  <span>4.2 - </span>
                  <img
                    className="p-1"
                    src={sortImgAsc}
                    alt="скрин-иконки-сортировки-возрастание"
                    style={{ width: "75px", height: "75px" }}
                  />
                  <br />
                  <span>4.3 - </span>
                  <img
                    className="p-1"
                    src={sortImgDesc}
                    alt="скрин-иконки-сортировки-убывание"
                    style={{ width: "75px", height: "75px" }}
                  />
                  <br />
                </td>
                <td>
                  <b>Сортровка по столбцу</b>
                  <br />
                  <br />
                  <p>
                    По умолчанию сортировка выполнена по добавлению в базу (по
                    возрастанию). <br />
                    <br />
                    Столбцы в заголовке рядом с названием имеют логтип
                    сортировки. Если столбец не отсортирован, то логтип серый
                    (4.1). Если выполнена сортировка по столбцу, то логтип
                    синий. <br />
                    <br />
                    В конкретный момент времени возможна сортировка только по
                    одному столбцу. <br />
                    <br />
                    Направление сортировки показывается логотипом (по
                    возрастанию - стрелка вверх и буквы "az" (4.2), или по
                    убыванию - стрелка вниз и буквы "za"(4.3) ).
                  </p>
                </td>
              </tr>
              <tr key="5" id="5" className="border">
                <td>5</td>
                <td>
                  <span>5.1 - </span>
                  <img
                    className="p-1"
                    src={deleteBtnImg}
                    alt="скрин-поля-видимости"
                  />
                  <br />
                  <span>5.2 - </span>
                  <img
                    className="p-1"
                    src={deletedRowImg}
                    alt="скрин-поля-видимости"
                    style={{ width: "400px" }}
                  />
                </td>
                <td>
                  <b>Отображение удаленных строк</b>
                  <br />
                  <br />
                  <p>
                    По умолчанию все удаленные строки скрыты.
                    <br />
                    <br />
                    Для отображения удаленных строк необходимо нажать на кнопку
                    "Отобразить удаленные" (5.1). После этого кнопка поменяет
                    цвет на желтый и надпись изменится на "Убрать удаленные".
                    <br />
                    <br />
                    Чтобы скрыть удаленные строки необходимо нажать на "Убрать
                    удаленные".
                    <br />
                    <br />
                    Удаленные строки имеют красный цвет.
                  </p>
                </td>
              </tr>
              <tr key="6" id="6" className="border bg-gray-50">
                <td>6</td>
                <td>
                  <span>6.1 - </span>
                  <img
                    className="p-1"
                    src={changeSingleImg}
                    alt="скрин-поля-видимости"
                  />
                  <br />
                  <span>6.2 - </span>
                  <img
                    className="p-1"
                    src={changeMassImg}
                    alt="скрин-поля-видимости"
                  />
                </td>
                <td>
                  <b>Удаление/восстановления строки таблицы</b>
                  <br />
                  <br />
                  <p>
                    При выборе одной строки появляются кнопки "Изменить элемент"
                    "Удалить"/Восстановить (рисунок 6.1). <br />
                    <br />
                    При выборе нескольких строк появляется другая кнопка
                    "Массовые действия" (рисунок 6.2), где есть возможность
                    удалить/восстановить. В будущем появится возможность массово
                    редактирования одного поля у нескольких строк.
                  </p>
                </td>
              </tr>
              <tr key="7" id="7" className="border">
                <td>7</td>
                <td>
                  <img src={draftsBtnImg} alt="скрин-поля-видимости" />
                </td>
                <td></td>
              </tr>
              
            </tbody>
          </table>
        </div>
      </div>
    </div>
  );
});

export default MainPage;
